Public Member Functions | Friends | List of all members
IFCAPI::v1::ObjectAccessor Class Referencefinal
IFC Data Access
To handle IFC objects, identifications and types. More...
#include <IFCObjectAccessor.hpp>
 Inheritance diagram for IFCAPI::v1::ObjectAccessor:
 Public Member Functions
ACAPI::Result< ObjectID >  | CreateIfcProjectObjectID () const
Create ObjectID for IfcProject.
ACAPI::Result< ObjectID >  | CreateIfcSiteObjectID () const
Create ObjectID for IfcSite.
ACAPI::Result< ObjectID >  | CreateIfcBuildingObjectID () const
Create ObjectID for IfcBuilding.
ACAPI::Result< ObjectID >  | CreateIfcBuildingStoreyObjectID (short floorNumber) const
Create ObjectID based on Archicad story.
ACAPI::Result< ObjectID >  | CreateElementObjectID (const API_Elem_Head &elementHead) const
Create ObjectID based on Archicad element.
ACAPI::Result< IfcGloballyUniqueId >  | GetGlobalId (const IFCAPI::ObjectID &objectID) const
Get IFC Identifier for an IFC entity.
ACAPI::Result< IfcGloballyUniqueId >  | GetExternalGlobalId (const IFCAPI::ObjectID &objectID) const
Get external IFC Identifier for an IFC entity.
ACAPI::Result< std::unordered_set< IFCAPI::ObjectID > >  | FindElementsByGlobalId (const IfcGloballyUniqueId &globalId) const
Find elements having a certain IFC identifier.
ACAPI::Result< API_Guid >  | GetAPIElementID (const IFCAPI::ObjectID &objectID) const
Get Archicad element guid from an IFC ObjectID.
ACAPI::Result< short >  | GetStoryIndex (const IFCAPI::ObjectID &objectID) const
Get Archicad story index from an IFC ObjectID.
ACAPI::Result< IFCType >  | GetIFCType (const IFCAPI::ObjectID &objectID) const
Get IFC type of an IFC entity.
ACAPI::Result< IFCType >  | GetTypeObjectIFCType (const IFCAPI::ObjectID &objectID) const
Get IFC type of the IfcTypeObject of an IFC entity.
ACAPI::Result< IFCAPI::Assignments >  | GetAssignments () const
Get the persistent Assignment Tree.
 Public Member Functions inherited from ACAPI::v1::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
ObjectAccessor  | GetObjectAccessor ()
Get the ObjectAccessor for handle IFC objects, identifications and types.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::v1::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::v1::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
To handle IFC objects, identifications and types.
Since
Archicad 28
Friends And Related Symbol Documentation
◆ GetObjectAccessor
 ObjectAccessor GetObjectAccessor  |  ( |   | )
friend
Get the ObjectAccessor for handle IFC objects, identifications and types.
Since
Archicad 28
Returns
The ObjectAccessor